//----------------------------------------------------------------------------------//

//赋值运算符

//----------------------------------------------------------------------------------//
 
//算数运算符
//算数运算符常和隐式类型转换相结合
//+号得String类型，-号得Number类型
true+true;//2
//一元运算符（++,--）
var x = "1";
console.log(++x);//2
var x = "1";
console.log(x+=1);//11加等于运算非结果为String类型

//----------------------------------------------------------------------------------//

//关系运算符
NaN==NaN//false
//===
//==若数据类型不一样先转换数据类型。引用数据类型转换成基本数据类型再进行比较
console.log(new Number(2)==2);

//----------------------------------------------------------------------------------//

//逻辑运算符
//对于&&来说，左侧为真时，返回右侧语句，左侧语句还会执行
//对于||来说，左侧为假时，返回右侧语句
//&&和||在实际中的应用
//-函数定义时给参数指定默认值，调用时未传参数则取它定义的值
var sum = function(a,b,c){
    b = b||4;//b有参数时||语句不会执行4，但b传0的时候语句仍会执行4
    c = c||5;
    return a+b+c;
}
//改进
var sum = function(){
    if(b!=false){b = b||4;}//(b!=false)&&(b=b||4);,用&&代替if判断
    if(c!=false){c = c||3;}
}